[Czech]
AuthorCredits = Sisah
Friends = Pøátelé
Achievements = Achievementy
Lobby browser = Prohlížeè Lobby
Settings = Nastavení
Console = Konzole
Close = Zavøít
Stats = Statistiky
of = z
Join = Pøipojit
Refresh = Aktualizovat
SHOW FPS COUNTER IN-GAME = Zobrazit FPS ve høe
SHOW CHAT NOTIFICATION = Zobrazit upozornìní pro chat
SHOW ACHIEVEMENTS NOTIFICATION = Zobrazit upozornìní pro úspìchy
SHOW INVITE NOTIFICATION = Zobrazit upozornìní pøi pozvání
Show screenshot notification = Zobrazit upozornìní pøi screenshotu
ENABLE ONLINE CONNECTION = Povolit online pøipojení
Achievements Earned = Achievementù získáno
Unlocked = Získáno
Playing = Ve høe 
Send message... = Poslat zprávu
Join Game = Pøipojit se do hry
Invite to game = Pozvat do hry
Add nickname = Pøidat pøezdívku
Block All Communication = Blokovat veškerou komunikaci
Unblock Communication = Odblokovat veškerou komunikaci
Add a persistent nickname to this player to keep track of who they are. = Pøidat trvalou pøezdíku tomuto hráèi.
Save = Uložit
Cancel = Zrušit
Searching... = Hledám...
No lobby found = Žádné lobby nenalezeno
1 lobby found = Nalezeno 1 lobby
lobbies found = nalezených lobby
Has sent you a message = Ti poslal zprávu
Invited you to join their game = Tì pozval do své hry
Press = Stiskni
to accept = pro pøijetí 
Show Data = Zobrazit detaily
Hide Data = Skrýt detaily
Gallery = Galerie

[Russian]
AuthorCredits = Shlak
Friends = Друзья
Achievements = Достижения
Lobby browser = Найти игру
Settings = Настройки
Console = Консоль
Close = Закрыть
Stats = Статистика
of = из
Join = Подключиться
Refresh = Обновить
SHOW FPS COUNTER IN-GAME = Показывать FPS в игре
SHOW CHAT NOTIFICATION = Показывать уведомления чата
SHOW ACHIEVEMENTS NOTIFICATION = Показывать достижения в игре
SHOW INVITE NOTIFICATION = Показывать приглашения в игру
Show screenshot notification = Показывать превью скриншота
ENABLE ONLINE CONNECTION = Включить online соединение
Achievements Earned = достижения открыты
Unlocked = Открыто
Playing = В игре
Send message... = Отправить сообщение
Join Game = Подключиться к игре
Invite to game = Пригласить в игру
Add nickname = Добавить псевдоним
Block All Communication = Заблокировать связь
Unblock Communication = Разблокировать связь
Add a persistent nickname to this player to keep track of who they are. = Добавьте постоянный псевдоним игроку, чтобы не потерять его.  
Save = Сохранить
Cancel = Отменить
Searching... = Поиск...
No lobby found = Игр не найдено
1 lobby found = Найдена 1 игра
lobbies found = игр найдено
Has sent you a message = Отправил вам сообщение
Invited you to join юheir game = Приглашает вас присоединиться к игре 
Press = Нажмите
to accept = для продолжения
Show Data = Подробно
Hide Data = Кратко
Gallery = Галерея

[Spanish]
AuthorCredits = xatornet
Friends = Amigos
Achievements = Logros
Lobby browser = Lista de Servidores
Settings = Configuracion
Console = Consola
Close = Cerrar
Stats = Estadisticas
of = de
Join = Unirse
Refresh = Actualizar
SHOW FPS COUNTER IN-GAME = Mostrar contador de FPS ingame
SHOW CHAT NOTIFICATION = Mostrar notificaciones del chat
SHOW ACHIEVEMENTS NOTIFICATION = Mostrar notificaciones de logros
SHOW INVITE NOTIFICATION = Mostrar notificaciones de invitacion
Show screenshot notification = Mostrar notificaciones de capturas
ENABLE ONLINE CONNECTION = Habilitar conexion online
Achievements Earned = Logros obtenidos
Unlocked = Desbloqueado
Playing = Jugando a
Send message... = Enviar mensaje
Join Game = Unirse a partida
Invite to game = Invitar a la partida
Add nickname = Añadir nombre
Block All Communication = Bloquear toda comunicacion
Unblock Communication = Desbloquear comunicacion
Add a persistent nickname to this player to keep track of who they are. = Añadir un nombre persistente a este jugador para saber en todo momento quien es.
Save = Guardar
Cancel = Cancelar
Searching... = Buscando...
No lobby found = No se encontraron servidores
1 lobby found = 1 servidor encontrado
lobbies found = servidores encontrados
Has sent you a message = te ha enviado un mensaje
Invited you to join their game = te ha envitado a unirte a su partida
Press = Pulsa
to accept = para aceptar 
Show Data = Ver datos
Hide Data = Ocultar datos
Gallery = Galeria